/* automatically generated by rust-bindgen 0.72.0 */

pub const EXCEPTION_TYPE_UNKNOWN: ::core::ffi::c_uint = 0;
pub const EXCEPTION_TYPE_RESET: ::core::ffi::c_uint = 1;
pub const EXCEPTION_TYPE_CRITICAL: ::core::ffi::c_uint = 2;
pub const EXCEPTION_TYPE_SYSCALL: ::core::ffi::c_uint = 3;
pub const exception_code_t_EXCEPTION_CODE_INTERRUPT: exception_code_t = 0;
pub const exception_code_t_EXCEPTION_CODE_TLB_MODIFICATION: exception_code_t = 1;
pub const exception_code_t_EXCEPTION_CODE_TLB_LOAD_I_MISS: exception_code_t = 2;
pub const exception_code_t_EXCEPTION_CODE_TLB_STORE_MISS: exception_code_t = 3;
pub const exception_code_t_EXCEPTION_CODE_LOAD_I_ADDRESS_ERROR: exception_code_t = 4;
pub const exception_code_t_EXCEPTION_CODE_STORE_ADDRESS_ERROR: exception_code_t = 5;
pub const exception_code_t_EXCEPTION_CODE_I_BUS_ERROR: exception_code_t = 6;
pub const exception_code_t_EXCEPTION_CODE_D_BUS_ERROR: exception_code_t = 7;
pub const exception_code_t_EXCEPTION_CODE_SYS_CALL: exception_code_t = 8;
pub const exception_code_t_EXCEPTION_CODE_BREAKPOINT: exception_code_t = 9;
pub const exception_code_t_EXCEPTION_CODE_RESERVED_INSTRUCTION: exception_code_t = 10;
pub const exception_code_t_EXCEPTION_CODE_COPROCESSOR_UNUSABLE: exception_code_t = 11;
pub const exception_code_t_EXCEPTION_CODE_ARITHMETIC_OVERFLOW: exception_code_t = 12;
pub const exception_code_t_EXCEPTION_CODE_TRAP: exception_code_t = 13;
pub const exception_code_t_EXCEPTION_CODE_FLOATING_POINT: exception_code_t = 15;
pub const exception_code_t_EXCEPTION_CODE_WATCH: exception_code_t = 23;
pub type exception_code_t = ::core::ffi::c_uint;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct reg_block_t {
    pub __bindgen_anon_1: reg_block_t__bindgen_ty_1,
    pub hi: u64,
    pub lo: u64,
    pub sr: u32,
    pub cr: u32,
    pub epc: u32,
    pub fc31: u32,
    pub fpr: [u64; 32usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union reg_block_t__bindgen_ty_1 {
    pub gpr: [u64; 32usize],
    pub __bindgen_anon_1: reg_block_t__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_block_t__bindgen_ty_1__bindgen_ty_1 {
    pub zr: u64,
    pub at: u64,
    pub v0: u64,
    pub v1: u64,
    pub a0: u64,
    pub a1: u64,
    pub a2: u64,
    pub a3: u64,
    pub t0: u64,
    pub t1: u64,
    pub t2: u64,
    pub t3: u64,
    pub t4: u64,
    pub t5: u64,
    pub t6: u64,
    pub t7: u64,
    pub s0: u64,
    pub s1: u64,
    pub s2: u64,
    pub s3: u64,
    pub s4: u64,
    pub s5: u64,
    pub s6: u64,
    pub s7: u64,
    pub t8: u64,
    pub t9: u64,
    pub k0: u64,
    pub k1: u64,
    pub gp: u64,
    pub sp: u64,
    pub fp: u64,
    pub ra: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_block_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<reg_block_t__bindgen_ty_1__bindgen_ty_1>() - 256usize];
    ["Alignment of reg_block_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<reg_block_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::zr"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, zr) - 0usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::at"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, at) - 8usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::v0"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, v0) - 16usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::v1"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, v1) - 24usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::a0"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, a0) - 32usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::a1"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, a1) - 40usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::a2"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, a2) - 48usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::a3"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, a3) - 56usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t0"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t0) - 64usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t1"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t1) - 72usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t2"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t2) - 80usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t3"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t3) - 88usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t4"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t4) - 96usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t5"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t5) - 104usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t6"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t6) - 112usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t7"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t7) - 120usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s0"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s0) - 128usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s1"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s1) - 136usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s2"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s2) - 144usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s3"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s3) - 152usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s4"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s4) - 160usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s5"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s5) - 168usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s6"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s6) - 176usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::s7"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, s7) - 184usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t8"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t8) - 192usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::t9"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, t9) - 200usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::k0"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, k0) - 208usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::k1"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, k1) - 216usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::gp"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, gp) - 224usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::sp"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, sp) - 232usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::fp"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, fp) - 240usize];
    ["Offset of field: reg_block_t__bindgen_ty_1__bindgen_ty_1::ra"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1__bindgen_ty_1, ra) - 248usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_block_t__bindgen_ty_1"]
        [::core::mem::size_of::<reg_block_t__bindgen_ty_1>() - 256usize];
    ["Alignment of reg_block_t__bindgen_ty_1"]
        [::core::mem::align_of::<reg_block_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: reg_block_t__bindgen_ty_1::gpr"]
        [::core::mem::offset_of!(reg_block_t__bindgen_ty_1, gpr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_block_t"][::core::mem::size_of::<reg_block_t>() - 544usize];
    ["Alignment of reg_block_t"][::core::mem::align_of::<reg_block_t>() - 1usize];
    ["Offset of field: reg_block_t::hi"][::core::mem::offset_of!(reg_block_t, hi) - 256usize];
    ["Offset of field: reg_block_t::lo"][::core::mem::offset_of!(reg_block_t, lo) - 264usize];
    ["Offset of field: reg_block_t::sr"][::core::mem::offset_of!(reg_block_t, sr) - 272usize];
    ["Offset of field: reg_block_t::cr"][::core::mem::offset_of!(reg_block_t, cr) - 276usize];
    ["Offset of field: reg_block_t::epc"][::core::mem::offset_of!(reg_block_t, epc) - 280usize];
    ["Offset of field: reg_block_t::fc31"][::core::mem::offset_of!(reg_block_t, fc31) - 284usize];
    ["Offset of field: reg_block_t::fpr"][::core::mem::offset_of!(reg_block_t, fpr) - 288usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exception_t {
    pub type_: i32,
    pub code: exception_code_t,
    pub info: *const ::core::ffi::c_char,
    pub regs: *mut reg_block_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exception_t"][::core::mem::size_of::<exception_t>() - 16usize];
    ["Alignment of exception_t"][::core::mem::align_of::<exception_t>() - 4usize];
    ["Offset of field: exception_t::type_"][::core::mem::offset_of!(exception_t, type_) - 0usize];
    ["Offset of field: exception_t::code"][::core::mem::offset_of!(exception_t, code) - 4usize];
    ["Offset of field: exception_t::info"][::core::mem::offset_of!(exception_t, info) - 8usize];
    ["Offset of field: exception_t::regs"][::core::mem::offset_of!(exception_t, regs) - 12usize];
};
pub type exception_handler_t = ::core::option::Option<unsafe extern "C" fn(exc: *mut exception_t)>;
pub type syscall_handler_t =
    ::core::option::Option<unsafe extern "C" fn(exc: *mut exception_t, code: u32)>;
unsafe extern "C" {
    pub fn register_exception_handler(cb: exception_handler_t) -> exception_handler_t;
    pub fn exception_default_handler(ex: *mut exception_t);
    pub fn register_syscall_handler(handler: syscall_handler_t, first_code: u32, last_code: u32);
}
