/* automatically generated by rust-bindgen 0.72.0 */

pub const FAT_MOUNT_DEFERRED: u32 = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fat_disk_t {
    pub disk_initialize: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub disk_status: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub disk_read: ::core::option::Option<
        unsafe extern "C" fn(
            buff: *mut u8,
            sector: i64,
            count: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub disk_write: ::core::option::Option<
        unsafe extern "C" fn(
            buff: *const u8,
            sector: i64,
            count: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub disk_ioctl: ::core::option::Option<
        unsafe extern "C" fn(cmd: u8, buff: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fat_disk_t"][::core::mem::size_of::<fat_disk_t>() - 20usize];
    ["Alignment of fat_disk_t"][::core::mem::align_of::<fat_disk_t>() - 4usize];
    ["Offset of field: fat_disk_t::disk_initialize"]
        [::core::mem::offset_of!(fat_disk_t, disk_initialize) - 0usize];
    ["Offset of field: fat_disk_t::disk_status"]
        [::core::mem::offset_of!(fat_disk_t, disk_status) - 4usize];
    ["Offset of field: fat_disk_t::disk_read"]
        [::core::mem::offset_of!(fat_disk_t, disk_read) - 8usize];
    ["Offset of field: fat_disk_t::disk_write"]
        [::core::mem::offset_of!(fat_disk_t, disk_write) - 12usize];
    ["Offset of field: fat_disk_t::disk_ioctl"]
        [::core::mem::offset_of!(fat_disk_t, disk_ioctl) - 16usize];
};
unsafe extern "C" {
    pub fn fat_mount(
        prefix: *const ::core::ffi::c_char,
        disk: *const fat_disk_t,
        flags: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
