/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct color_t {
    pub r: u8,
    pub g: u8,
    pub b: u8,
    pub a: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of color_t"][::core::mem::size_of::<color_t>() - 4usize];
    ["Alignment of color_t"][::core::mem::align_of::<color_t>() - 1usize];
    ["Offset of field: color_t::r"][::core::mem::offset_of!(color_t, r) - 0usize];
    ["Offset of field: color_t::g"][::core::mem::offset_of!(color_t, g) - 1usize];
    ["Offset of field: color_t::b"][::core::mem::offset_of!(color_t, b) - 2usize];
    ["Offset of field: color_t::a"][::core::mem::offset_of!(color_t, a) - 3usize];
};
unsafe extern "C" {
    pub fn graphics_make_color(
        r: ::core::ffi::c_int,
        g: ::core::ffi::c_int,
        b: ::core::ffi::c_int,
        a: ::core::ffi::c_int,
    ) -> u32;
    pub fn graphics_convert_color(color: color_t) -> u32;
    pub fn graphics_draw_pixel(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        color: u32,
    );
    pub fn graphics_draw_pixel_trans(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        color: u32,
    );
    pub fn graphics_draw_line(
        surf: *mut crate::surface::surface_t,
        x0: ::core::ffi::c_int,
        y0: ::core::ffi::c_int,
        x1: ::core::ffi::c_int,
        y1: ::core::ffi::c_int,
        color: u32,
    );
    pub fn graphics_draw_line_trans(
        surf: *mut crate::surface::surface_t,
        x0: ::core::ffi::c_int,
        y0: ::core::ffi::c_int,
        x1: ::core::ffi::c_int,
        y1: ::core::ffi::c_int,
        color: u32,
    );
    pub fn graphics_draw_box(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: u32,
    );
    pub fn graphics_draw_box_trans(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: u32,
    );
    pub fn graphics_fill_screen(surf: *mut crate::surface::surface_t, c: u32);
    pub fn graphics_set_color(forecolor: u32, backcolor: u32);
    pub fn graphics_set_default_font();
    pub fn graphics_set_font_sprite(font: *mut crate::sprite::sprite_t);
    pub fn graphics_draw_character(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        ch: ::core::ffi::c_char,
    );
    pub fn graphics_draw_text(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        msg: *const ::core::ffi::c_char,
    );
    pub fn graphics_draw_sprite(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        sprite: *mut crate::sprite::sprite_t,
    );
    pub fn graphics_draw_sprite_stride(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        sprite: *mut crate::sprite::sprite_t,
        offset: ::core::ffi::c_int,
    );
    pub fn graphics_draw_sprite_trans(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        sprite: *mut crate::sprite::sprite_t,
    );
    pub fn graphics_draw_sprite_trans_stride(
        surf: *mut crate::surface::surface_t,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        sprite: *mut crate::sprite::sprite_t,
        offset: ::core::ffi::c_int,
    );
}
