/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
pub struct ksemaphore_t {
    pub mutex: crate::kernel::kmutex_t,
    pub cond: crate::kernel::kcond_t,
    pub count: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ksemaphore_t"][::core::mem::size_of::<ksemaphore_t>() - 16usize];
    ["Alignment of ksemaphore_t"][::core::mem::align_of::<ksemaphore_t>() - 4usize];
    ["Offset of field: ksemaphore_t::mutex"][::core::mem::offset_of!(ksemaphore_t, mutex) - 0usize];
    ["Offset of field: ksemaphore_t::cond"][::core::mem::offset_of!(ksemaphore_t, cond) - 8usize];
    ["Offset of field: ksemaphore_t::count"]
        [::core::mem::offset_of!(ksemaphore_t, count) - 12usize];
};
unsafe extern "C" {
    pub fn ksemaphore_init(sem: *mut ksemaphore_t, value: ::core::ffi::c_int);
    pub fn ksemaphore_destroy(sem: *mut ksemaphore_t);
    pub fn ksemaphore_post(sem: *mut ksemaphore_t);
    pub fn ksemaphore_wait(sem: *mut ksemaphore_t);
    pub fn ksemaphore_try_wait(sem: *mut ksemaphore_t, ticks: u32) -> bool;
}
