/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdpq_font_s {
    _unused: [u8; 0],
}
pub type rdpq_font_t = rdpq_font_s;
pub const rdpq_textwrap_t_WRAP_NONE: rdpq_textwrap_t = 0;
pub const rdpq_textwrap_t_WRAP_ELLIPSES: rdpq_textwrap_t = 1;
pub const rdpq_textwrap_t_WRAP_CHAR: rdpq_textwrap_t = 2;
pub const rdpq_textwrap_t_WRAP_WORD: rdpq_textwrap_t = 3;
pub type rdpq_textwrap_t = ::core::ffi::c_uint;
pub const rdpq_align_t_ALIGN_LEFT: rdpq_align_t = 0;
pub const rdpq_align_t_ALIGN_CENTER: rdpq_align_t = 1;
pub const rdpq_align_t_ALIGN_RIGHT: rdpq_align_t = 2;
pub type rdpq_align_t = ::core::ffi::c_uint;
pub const rdpq_valign_t_VALIGN_TOP: rdpq_valign_t = 0;
pub const rdpq_valign_t_VALIGN_CENTER: rdpq_valign_t = 1;
pub const rdpq_valign_t_VALIGN_BOTTOM: rdpq_valign_t = 2;
pub type rdpq_valign_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdpq_textparms_s {
    pub style_id: i16,
    pub width: i16,
    pub height: i16,
    pub align: rdpq_align_t,
    pub valign: rdpq_valign_t,
    pub indent: i16,
    pub max_chars: i16,
    pub char_spacing: i16,
    pub line_spacing: i16,
    pub wrap: rdpq_textwrap_t,
    pub tabstops: *mut i16,
    pub disable_aa_fix: bool,
    pub preserve_overlap: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rdpq_textparms_s"][::core::mem::size_of::<rdpq_textparms_s>() - 36usize];
    ["Alignment of rdpq_textparms_s"][::core::mem::align_of::<rdpq_textparms_s>() - 4usize];
    ["Offset of field: rdpq_textparms_s::style_id"]
        [::core::mem::offset_of!(rdpq_textparms_s, style_id) - 0usize];
    ["Offset of field: rdpq_textparms_s::width"]
        [::core::mem::offset_of!(rdpq_textparms_s, width) - 2usize];
    ["Offset of field: rdpq_textparms_s::height"]
        [::core::mem::offset_of!(rdpq_textparms_s, height) - 4usize];
    ["Offset of field: rdpq_textparms_s::align"]
        [::core::mem::offset_of!(rdpq_textparms_s, align) - 8usize];
    ["Offset of field: rdpq_textparms_s::valign"]
        [::core::mem::offset_of!(rdpq_textparms_s, valign) - 12usize];
    ["Offset of field: rdpq_textparms_s::indent"]
        [::core::mem::offset_of!(rdpq_textparms_s, indent) - 16usize];
    ["Offset of field: rdpq_textparms_s::max_chars"]
        [::core::mem::offset_of!(rdpq_textparms_s, max_chars) - 18usize];
    ["Offset of field: rdpq_textparms_s::char_spacing"]
        [::core::mem::offset_of!(rdpq_textparms_s, char_spacing) - 20usize];
    ["Offset of field: rdpq_textparms_s::line_spacing"]
        [::core::mem::offset_of!(rdpq_textparms_s, line_spacing) - 22usize];
    ["Offset of field: rdpq_textparms_s::wrap"]
        [::core::mem::offset_of!(rdpq_textparms_s, wrap) - 24usize];
    ["Offset of field: rdpq_textparms_s::tabstops"]
        [::core::mem::offset_of!(rdpq_textparms_s, tabstops) - 28usize];
    ["Offset of field: rdpq_textparms_s::disable_aa_fix"]
        [::core::mem::offset_of!(rdpq_textparms_s, disable_aa_fix) - 32usize];
    ["Offset of field: rdpq_textparms_s::preserve_overlap"]
        [::core::mem::offset_of!(rdpq_textparms_s, preserve_overlap) - 33usize];
};
pub type rdpq_textparms_t = rdpq_textparms_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdpq_textmetrics_t {
    pub advance_x: f32,
    pub advance_y: f32,
    pub utf8_text_advance: ::core::ffi::c_int,
    pub nlines: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rdpq_textmetrics_t"][::core::mem::size_of::<rdpq_textmetrics_t>() - 16usize];
    ["Alignment of rdpq_textmetrics_t"][::core::mem::align_of::<rdpq_textmetrics_t>() - 4usize];
    ["Offset of field: rdpq_textmetrics_t::advance_x"]
        [::core::mem::offset_of!(rdpq_textmetrics_t, advance_x) - 0usize];
    ["Offset of field: rdpq_textmetrics_t::advance_y"]
        [::core::mem::offset_of!(rdpq_textmetrics_t, advance_y) - 4usize];
    ["Offset of field: rdpq_textmetrics_t::utf8_text_advance"]
        [::core::mem::offset_of!(rdpq_textmetrics_t, utf8_text_advance) - 8usize];
    ["Offset of field: rdpq_textmetrics_t::nlines"]
        [::core::mem::offset_of!(rdpq_textmetrics_t, nlines) - 12usize];
};
unsafe extern "C" {
    pub fn rdpq_text_register_font(font_id: u8, font: *const rdpq_font_t);
    pub fn rdpq_text_unregister_font(font_id: u8);
    pub fn rdpq_text_get_font(font_id: u8) -> *const rdpq_font_t;
    pub fn rdpq_text_printn(
        parms: *const rdpq_textparms_t,
        font_id: u8,
        x0: f32,
        y0: f32,
        utf8_text: *const ::core::ffi::c_char,
        nbytes: ::core::ffi::c_int,
    ) -> rdpq_textmetrics_t;
    pub fn rdpq_text_printf(
        parms: *const rdpq_textparms_t,
        font_id: u8,
        x0: f32,
        y0: f32,
        utf8_fmt: *const ::core::ffi::c_char,
        ...
    ) -> rdpq_textmetrics_t;
}
