/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
pub struct rdpq_trifmt_s {
    pub pos_offset: ::core::ffi::c_int,
    pub shade_offset: ::core::ffi::c_int,
    pub shade_flat: bool,
    pub tex_offset: ::core::ffi::c_int,
    pub tex_tile: crate::rdpq::rdpq_tile_t,
    pub tex_mipmaps: ::core::ffi::c_int,
    pub z_offset: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rdpq_trifmt_s"][::core::mem::size_of::<rdpq_trifmt_s>() - 28usize];
    ["Alignment of rdpq_trifmt_s"][::core::mem::align_of::<rdpq_trifmt_s>() - 4usize];
    ["Offset of field: rdpq_trifmt_s::pos_offset"]
        [::core::mem::offset_of!(rdpq_trifmt_s, pos_offset) - 0usize];
    ["Offset of field: rdpq_trifmt_s::shade_offset"]
        [::core::mem::offset_of!(rdpq_trifmt_s, shade_offset) - 4usize];
    ["Offset of field: rdpq_trifmt_s::shade_flat"]
        [::core::mem::offset_of!(rdpq_trifmt_s, shade_flat) - 8usize];
    ["Offset of field: rdpq_trifmt_s::tex_offset"]
        [::core::mem::offset_of!(rdpq_trifmt_s, tex_offset) - 12usize];
    ["Offset of field: rdpq_trifmt_s::tex_tile"]
        [::core::mem::offset_of!(rdpq_trifmt_s, tex_tile) - 16usize];
    ["Offset of field: rdpq_trifmt_s::tex_mipmaps"]
        [::core::mem::offset_of!(rdpq_trifmt_s, tex_mipmaps) - 20usize];
    ["Offset of field: rdpq_trifmt_s::z_offset"]
        [::core::mem::offset_of!(rdpq_trifmt_s, z_offset) - 24usize];
};
pub type rdpq_trifmt_t = rdpq_trifmt_s;
unsafe extern "C" {
    pub static TRIFMT_FILL: rdpq_trifmt_t;
    pub static TRIFMT_SHADE: rdpq_trifmt_t;
    pub static TRIFMT_TEX: rdpq_trifmt_t;
    pub static TRIFMT_SHADE_TEX: rdpq_trifmt_t;
    pub static TRIFMT_ZBUF: rdpq_trifmt_t;
    pub static TRIFMT_ZBUF_SHADE: rdpq_trifmt_t;
    pub static TRIFMT_ZBUF_TEX: rdpq_trifmt_t;
    pub static TRIFMT_ZBUF_SHADE_TEX: rdpq_trifmt_t;
    pub fn rdpq_triangle(fmt: *const rdpq_trifmt_t, v1: *const f32, v2: *const f32, v3: *const f32);
}
