/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rspq_profile_slot_s {
    pub total_ticks: u64,
    pub sample_count: u64,
    pub name: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rspq_profile_slot_s"][::core::mem::size_of::<rspq_profile_slot_s>() - 24usize];
    ["Alignment of rspq_profile_slot_s"][::core::mem::align_of::<rspq_profile_slot_s>() - 8usize];
    ["Offset of field: rspq_profile_slot_s::total_ticks"]
        [::core::mem::offset_of!(rspq_profile_slot_s, total_ticks) - 0usize];
    ["Offset of field: rspq_profile_slot_s::sample_count"]
        [::core::mem::offset_of!(rspq_profile_slot_s, sample_count) - 8usize];
    ["Offset of field: rspq_profile_slot_s::name"]
        [::core::mem::offset_of!(rspq_profile_slot_s, name) - 16usize];
};
pub type rspq_profile_slot_t = rspq_profile_slot_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rspq_profile_data_s {
    pub slots: [rspq_profile_slot_t; 21usize],
    pub total_ticks: u64,
    pub rdp_busy_ticks: u64,
    pub frame_count: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rspq_profile_data_s"][::core::mem::size_of::<rspq_profile_data_s>() - 528usize];
    ["Alignment of rspq_profile_data_s"][::core::mem::align_of::<rspq_profile_data_s>() - 8usize];
    ["Offset of field: rspq_profile_data_s::slots"]
        [::core::mem::offset_of!(rspq_profile_data_s, slots) - 0usize];
    ["Offset of field: rspq_profile_data_s::total_ticks"]
        [::core::mem::offset_of!(rspq_profile_data_s, total_ticks) - 504usize];
    ["Offset of field: rspq_profile_data_s::rdp_busy_ticks"]
        [::core::mem::offset_of!(rspq_profile_data_s, rdp_busy_ticks) - 512usize];
    ["Offset of field: rspq_profile_data_s::frame_count"]
        [::core::mem::offset_of!(rspq_profile_data_s, frame_count) - 520usize];
};
pub type rspq_profile_data_t = rspq_profile_data_s;
unsafe extern "C" {
    pub fn rspq_profile_start();
    pub fn rspq_profile_stop();
    pub fn rspq_profile_reset();
    pub fn rspq_profile_next_frame();
    pub fn rspq_profile_dump();
    pub fn rspq_profile_get_data(data: *mut rspq_profile_data_t);
}
