/* automatically generated by rust-bindgen 0.72.0 */

pub const RTC_ESUCCESS: u32 = 0;
pub const RTC_ENOCLOCK: i32 = -1;
pub const RTC_EBADCLOCK: i32 = -2;
pub const RTC_EBADTIME: i32 = -3;
pub const RTC_SOFT_TIMESTAMP_MIN: u32 = 0;
pub const RTC_SOFT_TIMESTAMP_MAX: u32 = 4102444799;
pub const rtc_source_t_RTC_SOURCE_NONE: rtc_source_t = 0;
pub const rtc_source_t_RTC_SOURCE_JOYBUS: rtc_source_t = 1;
pub const rtc_source_t_RTC_SOURCE_DD: rtc_source_t = 2;
pub const rtc_source_t_RTC_SOURCE_BB: rtc_source_t = 3;
pub type rtc_source_t = ::core::ffi::c_uint;
pub type time_t = ::core::ffi::c_longlong;
#[repr(C)]
pub struct rtc_range_t {
    pub min: time_t,
    pub max: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rtc_range_t"][::core::mem::size_of::<rtc_range_t>() - 16usize];
    ["Alignment of rtc_range_t"][::core::mem::align_of::<rtc_range_t>() - 8usize];
    ["Offset of field: rtc_range_t::min"][::core::mem::offset_of!(rtc_range_t, min) - 0usize];
    ["Offset of field: rtc_range_t::max"][::core::mem::offset_of!(rtc_range_t, max) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtc_time_t {
    pub year: u16,
    pub month: u8,
    pub day: u8,
    pub hour: u8,
    pub min: u8,
    pub sec: u8,
    pub week_day: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rtc_time_t"][::core::mem::size_of::<rtc_time_t>() - 8usize];
    ["Alignment of rtc_time_t"][::core::mem::align_of::<rtc_time_t>() - 2usize];
    ["Offset of field: rtc_time_t::year"][::core::mem::offset_of!(rtc_time_t, year) - 0usize];
    ["Offset of field: rtc_time_t::month"][::core::mem::offset_of!(rtc_time_t, month) - 2usize];
    ["Offset of field: rtc_time_t::day"][::core::mem::offset_of!(rtc_time_t, day) - 3usize];
    ["Offset of field: rtc_time_t::hour"][::core::mem::offset_of!(rtc_time_t, hour) - 4usize];
    ["Offset of field: rtc_time_t::min"][::core::mem::offset_of!(rtc_time_t, min) - 5usize];
    ["Offset of field: rtc_time_t::sec"][::core::mem::offset_of!(rtc_time_t, sec) - 6usize];
    ["Offset of field: rtc_time_t::week_day"]
        [::core::mem::offset_of!(rtc_time_t, week_day) - 7usize];
};
unsafe extern "C" {
    pub fn rtc_error_str(error: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
    pub fn rtc_init_async();
    pub fn rtc_init() -> bool;
    pub fn rtc_close();
    pub fn rtc_is_source_available(source: rtc_source_t) -> bool;
    pub fn rtc_get_source() -> rtc_source_t;
    pub fn rtc_set_source(source: rtc_source_t) -> ::core::ffi::c_int;
    pub fn rtc_get_source_supported_range(source: rtc_source_t) -> rtc_range_t;
    pub fn rtc_get_supported_range() -> rtc_range_t;
    pub fn rtc_get(rtc_time: *mut rtc_time_t) -> bool;
    pub fn rtc_set(rtc_time: *mut rtc_time_t) -> bool;
}
