/* automatically generated by rust-bindgen 0.72.0 */

pub const SURFACE_FLAGS_TEXFORMAT: u32 = 31;
pub const SURFACE_FLAGS_OWNEDBUFFER: u32 = 32;
pub const SURFACE_FLAGS_TEXINDEX: u32 = 3840;
pub const tex_format_t_FMT_NONE: tex_format_t = 0;
pub const tex_format_t_FMT_RGBA16: tex_format_t = 2;
pub const tex_format_t_FMT_RGBA32: tex_format_t = 3;
pub const tex_format_t_FMT_YUV16: tex_format_t = 6;
pub const tex_format_t_FMT_CI4: tex_format_t = 8;
pub const tex_format_t_FMT_CI8: tex_format_t = 9;
pub const tex_format_t_FMT_IA4: tex_format_t = 12;
pub const tex_format_t_FMT_IA8: tex_format_t = 13;
pub const tex_format_t_FMT_IA16: tex_format_t = 14;
pub const tex_format_t_FMT_I4: tex_format_t = 16;
pub const tex_format_t_FMT_I8: tex_format_t = 17;
pub type tex_format_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct surface_s {
    pub flags: u16,
    pub width: u16,
    pub height: u16,
    pub stride: u16,
    pub buffer: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of surface_s"][::core::mem::size_of::<surface_s>() - 12usize];
    ["Alignment of surface_s"][::core::mem::align_of::<surface_s>() - 4usize];
    ["Offset of field: surface_s::flags"][::core::mem::offset_of!(surface_s, flags) - 0usize];
    ["Offset of field: surface_s::width"][::core::mem::offset_of!(surface_s, width) - 2usize];
    ["Offset of field: surface_s::height"][::core::mem::offset_of!(surface_s, height) - 4usize];
    ["Offset of field: surface_s::stride"][::core::mem::offset_of!(surface_s, stride) - 6usize];
    ["Offset of field: surface_s::buffer"][::core::mem::offset_of!(surface_s, buffer) - 8usize];
};
pub type surface_t = surface_s;
unsafe extern "C" {
    pub fn tex_format_name(fmt: tex_format_t) -> *const ::core::ffi::c_char;
    pub fn surface_alloc(format: tex_format_t, width: u16, height: u16) -> surface_t;
    pub fn surface_make_sub(
        parent: *mut surface_t,
        x0: u16,
        y0: u16,
        width: u16,
        height: u16,
    ) -> surface_t;
    pub fn surface_free(surface: *mut surface_t);
}
