/* automatically generated by rust-bindgen 0.72.0 */

pub const VI_REGISTERS_COUNT: u32 = 14;
pub const VI_DEDITHER_FILTER_ENABLE: u32 = 65536;
pub const VI_PIXEL_ADVANCE_DEFAULT: u32 = 12288;
pub const VI_PIXEL_ADVANCE_BBPLAYER: u32 = 4096;
pub const VI_AA_MODE_MASK: u32 = 768;
pub const VI_CTRL_SERRATE: u32 = 64;
pub const VI_DIVOT_ENABLE: u32 = 16;
pub const VI_CTRL_TYPE: u32 = 3;
pub const VI_CTRL_TYPE_32_BPP: u32 = 3;
pub const VI_CTRL_TYPE_16_BPP: u32 = 2;
pub const VI_CTRL_TYPE_OFF: u32 = 0;
pub const VI_V_CURRENT_VBLANK: u32 = 2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vi_borders_s {
    pub left: i16,
    pub right: i16,
    pub up: i16,
    pub down: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vi_borders_s"][::core::mem::size_of::<vi_borders_s>() - 8usize];
    ["Alignment of vi_borders_s"][::core::mem::align_of::<vi_borders_s>() - 2usize];
    ["Offset of field: vi_borders_s::left"][::core::mem::offset_of!(vi_borders_s, left) - 0usize];
    ["Offset of field: vi_borders_s::right"][::core::mem::offset_of!(vi_borders_s, right) - 2usize];
    ["Offset of field: vi_borders_s::up"][::core::mem::offset_of!(vi_borders_s, up) - 4usize];
    ["Offset of field: vi_borders_s::down"][::core::mem::offset_of!(vi_borders_s, down) - 6usize];
};
pub type vi_borders_t = vi_borders_s;
pub const vi_aa_mode_e_VI_AA_MODE_NONE: vi_aa_mode_e = 768;
pub const vi_aa_mode_e_VI_AA_MODE_RESAMPLE: vi_aa_mode_e = 512;
pub const vi_aa_mode_e_VI_AA_MODE_RESAMPLE_FETCH_NEEDED: vi_aa_mode_e = 256;
pub const vi_aa_mode_e_VI_AA_MODE_RESAMPLE_FETCH_ALWAYS: vi_aa_mode_e = 0;
pub type vi_aa_mode_e = ::core::ffi::c_uint;
pub use self::vi_aa_mode_e as vi_aa_mode_t;
pub const vi_gamma_e_VI_GAMMA_DISABLE: vi_gamma_e = 0;
pub const vi_gamma_e_VI_GAMMA_ENABLE: vi_gamma_e = 4;
pub const vi_gamma_e_VI_GAMMA_DITHER_ENABLE: vi_gamma_e = 12;
pub type vi_gamma_e = ::core::ffi::c_uint;
pub use self::vi_gamma_e as vi_gamma_t;
unsafe extern "C" {
    pub static mut __vi_cfg: [u32; 14usize];
    pub fn vi_init();
    pub fn vi_reset();
    pub fn vi_write_masked(reg: *mut u32, wmask: u32, value: u32);
    pub fn vi_write_begin();
    pub fn vi_write_end();
    pub fn vi_wait_vblank();
    pub fn vi_debug_dump(verbose: ::core::ffi::c_int);
    pub fn vi_install_vblank_handler(
        handler: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        arg: *mut ::core::ffi::c_void,
    );
    pub fn vi_uninstall_vblank_handler(
        handler: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        arg: *mut ::core::ffi::c_void,
    );
    pub fn vi_stabilize(reg: *mut u32, enable: bool);
    pub fn vi_blank(blank: bool);
    pub fn vi_get_refresh_rate() -> f32;
    pub fn vi_get_output(
        x0: *mut ::core::ffi::c_int,
        y0: *mut ::core::ffi::c_int,
        x1: *mut ::core::ffi::c_int,
        y1: *mut ::core::ffi::c_int,
    );
    pub fn vi_get_output_bounds(
        x0: *mut ::core::ffi::c_int,
        y0: *mut ::core::ffi::c_int,
        x1: *mut ::core::ffi::c_int,
        y1: *mut ::core::ffi::c_int,
    );
    pub fn vi_get_borders() -> vi_borders_t;
    pub fn vi_set_origin(
        buffer: *mut ::core::ffi::c_void,
        pixel_stride: ::core::ffi::c_int,
        bpp: ::core::ffi::c_int,
    );
    pub fn vi_set_xscale(fb_width: f32);
    pub fn vi_set_yscale(fb_height: f32);
    pub fn vi_set_xscale_factor(xfactor: f32);
    pub fn vi_set_yscale_factor(yfactor: f32);
    pub fn vi_set_interlaced(interlaced: bool);
    pub fn vi_set_aa_mode(aa_mode: vi_aa_mode_t);
    pub fn vi_set_divot(divot: bool);
    pub fn vi_set_dedither(dedither: bool);
    pub fn vi_set_gamma(gamma: vi_gamma_t);
    pub fn vi_set_output(
        x0: ::core::ffi::c_int,
        y0: ::core::ffi::c_int,
        x1: ::core::ffi::c_int,
        y1: ::core::ffi::c_int,
    );
    pub fn vi_move_output(x: ::core::ffi::c_int, y: ::core::ffi::c_int);
    pub fn vi_scroll_output(deltax: ::core::ffi::c_int, deltay: ::core::ffi::c_int);
    pub fn vi_calc_borders(aspect_ratio: f32, overscan_margin: f32) -> vi_borders_t;
    pub fn vi_set_borders(b: vi_borders_t);
    pub fn vi_show(fb: *mut crate::surface::surface_t);
}
